[
  "The theives guild has broken into the a tavern and refuses to leave.",
  "A bard. Not a magic one. Just a bard. A minstrel.",
  "A Man chasing after a woman through a corn field.",
  "A troll chokes to death eating a women in a corn field.",
  "The world's highest dragon lands and eats three deer. He tries to fly crashes then just sleeps where he fell.",
  "A circus is in town. A shitty circus. Like a mobile Chuck E. Cheeses during a power outage.",
  "A village is being savaged by the most passive aggressive wizard ever.",
  "Two heavily armed fighters going at it hammer and tongs in the middle of the road, Every attack is a miss on both sides.",
  "Suddenly ninjas. They don't attack or anything, they have better things to do.",
  "What looks like a sword is stabbed into a stone. Turns out it's just a hilt. Made of tin.",
  "A gnome, a halfling and a dwarf are having a 'who's the shortest' contest. It's fairly easy to resolve.",
  "A bandit calls for you to stand and deliver. He's not robbing you, he just really wants his package.",
  "An ugly old man offers you some of his lunch stew. It's not bad, could use some savory herb or something though.",
  "A young child is crying for his mom. His mom is maybe 40 feet away waiting for the kid to shut up and actually look.",
  "A carrot is near the road. A ranger yells at you for disturbing his rabbit bait.",
  "A rabbit is caught in a trap. A ranger yells at you for disturbing his fox bait.",
  "A fox is caught in a trap. A ranger yells at you for disturbing his wolf bait.",
  "A wolf is caught in a trap. A ranger yells at you for disturbing his bear bait.",
  "A bear is caught in a trap. A ranger yells at you for disturbing his owlbear bait.",
  "An owlbear is caught in a trap. A ranger yells at you for disturbing his ogre bait.",
  "An ogre caught in a trap. A ranger yells at you for disturbing his dragon bait.",
  "A dragon is caught in a trap. A ranger yells at you for disturbing his tarasque bait.",
  "A lovely gazebo is seen on the side of the road. It looks like a nice place for a picnic.",
  "An adventure party passes by whining about a lack of something called 'Cheetos' and some or of Dew of a Mountain.",
  "An adventure party passes by with each member spouting off silly 'Ni' noises or something about bushes. Weirdos.",
  "An adventure party passes by with a drow sneaky fellow wearing two scimitars whinging about wanting more 'Ex-Pee' because of 'Role-playing'. Weirdo.",
  "An armless, legless knight has bled out near a creek. Apparently his corpse has been here for a while. His armor seems to be made of paper.",
  "The local thieves guild has burst into your house moving every object in it a foot the right and leaving.",
  "A local child has taken to following you around asking you 'why' in the most obnoxious voice possible.",
  "An attractive bar wench starts flirting with you. If asked she'll gladly 'spend time' with you. Nothing else worth noting here.",
  "An attractive young blacksmith starts flirting with you. If asked he'll gladly 'spend time' with you. Nothing else worth noting here.",
  "The town drunk wraps an arm around you claiming 'You guys are all right' before puking on you and passing out.",
  "The town drunk wraps an arm around you apologizing to you for puking on you saying 'Happens to the best of us' before puking on you and passing out.",
  "The town drunk pukes on you and passes out.",
  "The worst pickpocket in the world attempts to rob you who easily notices it. Mostly he just ends up groping you and then running off.",
  "A fake wizard claims to be a real one. He flings glitter yelling 'Glitterrust!', trips on his robes and knocks himself out.",
  "A hobo claims to be a deposed king who will reward the you if you can return to him his seal which some other hobos stole and are hiding out under the town bridge. He is a fake king and really just wants to sleep under the bridge.",
  "A local noble badly disguised as a commonfolk, no one care since he's got money and is a fairly decent person.",
  "A short shower of copper bits fall from the sky. Like. 10 of them.",
  "A fairy offers you a wish if you can answer her riddles three. You agree and she leaves, saying she never thought someone would get that far.",
  "A knight slew a dragon here a few weeks ago. There's nothing valuable left here.",
  "A man in a nice set of robes is handing out pamphlets for the local good parish. Introduces himself as Brother Gideon.",
  "A man in a bad set of robes is handing out dead rats from the local evil temple. Introduces himself as Brother BabyStabber.",
  "A man in a decent set of robes is handing out blank pieces of paper from the local neutral temple. Introduces himself with a shrug and a sigh.",
  "A lumberjack is eating his lunch on the side of the road.",
  "A miner is eating his lunch on the side of the road.",
  "A cultist is eating his lunch on the side of the road.",
  "A perfectly serviceable wooden shield is found on the side of the road.",
  "A perfectly serviceable shortsword is found on the side of the road.",
  "There's a huge pot hole in the road. Like HUGE, for a pothole, it's not a pit or anything.",
  "A tune is heard off in the distance. Nothing in particular, just kind of a musical edge to the area. Like a light mist.",
  "A troop of guardsmen are patrolling the road.",
  "A man is selling sausages from a decent cart. The sausages are ok.",
  "A man is selling sausages from a crappy cart. The sausages are good, but you start to feel bad for eating too many of them. Like you ate an entire tin of ice cream bad.",
  "A man is selling sausages from a good cart with bread rolls. The bread is bland, and the spice in the sausage is forgettable, but it's filling.",
  "A man is selling wiener dogs from a cart that's barking. Not to eat. He's just selling the dogs. They make good mousers he says.",
  "A man in an alley is yelling to the sky 'I can't USE that with that.' 'I'll have to WALK over there to do that.' 'If only I could LOOK, at that object.' etc. No one pays him any regard.",
  "A woman in armor is offering to bed any man who can beat her in an arm wrestle. She's isn't particularly pretty, but if you're into that it's there.",
  "A bird poops right down the back of your clothes. Haha.",
  "A bird poops right in your eye. Haha.",
  "A bird poops right on your mouth. Haha.",
  "A branch or sign suddenly breaks it's base or chain or string and swings directly into your face.",
  "A lady hobo is telling shitty fortunes. She's got no takers so far.",
  "A group of bandits or pirates are dead drunk singing bawdily together off to one side.",
  "A group of guards catch and hang a thief who just ripped off the necklace of some girl and stole from a few stands.",
  "A group of guards force a group of prostitutes to 'Move along then.'",
  "A minstrel plays nearby. He's ok, but he'd be a lot better if he actually but some practice in.",
  "A local pubkeep offers you a round of drinks for half off on account of them looking thirsty.",
  "A local inn offers you a dinner half off on account of you looking hungry.",
  "A man missing a leg thanks you for the good that you have been doing.",
  "A man missing an arm spits at you for the good you missed doing.",
  "Two local children are re-enacting a bard-tale about a hero's adventures, they are arguing who gets to play the hero and who has to be the bad guy. They are yelling 'You were him last time!' 'Nuh-Uh!' 'Yeah-huh!'",
  "You step in poo.",
  "Two bards are utterly failing to sing a song in tune.",
  "Two bards are actually killing a particular song. The crowd around them is pretty into it.",
  "A man is selling hats. He's willing to trade for skins if anyone in you has any.",
  "You sees a mild acquaintance. S/He offers to get lunch with you.",
  "You sees a mild annoyance. S/He flips them the bird before wandering off.",
  "A pie eating contest is in progress. It looks like it's down to the blacksmith's son or the cowherd's daughter.",
  "Two teenagers are walking down the street holding hands and blushing whenever one catches the other's eye.",
  "A group of bandits charge, but get exhausted before they get to you.",
  "Seven men in hooded robes are chanting loudly in a circle before stopping and remove their hoods. One says to another: 'Good practice guys. Same time next week?'",
  "Seven men in hooded robes are fumbling around. Overhead is: 'Hey John, I think I've got your robes' 'Damnit Sev, your wife swapped our hoods again.' and 'Who's got my sash? It was the scarlet one.'",
  "A dark skinned elf is hung over on the side of the road. Three empty bottles of dwarven ale are nearby. He's waving his hands about muttering 'Turn off the sun.' Shortly after Dancing Lights twirl around his location as he lets out a groan of pain.",
  "A dwarf is passed out in a puddle of his own drool on the side of the road. A half empty bottle of elven wine is nearby.",
  "A friendly dog comes by and starts begging for treats.",
  "An unfriendly dog attempts to pee on you.",
  "Two old men are playing some sort of game on the side of the road talking mostly in murmurs, grunts, and chortles.",
  "Two old women are gossiping nearby knitting scarves longer than they are tall that are growing by the inch as you watch.",
  "A man is juggling torches nearby. Nothing goes amiss.",
  "Two young teenagers are arguing about whether a dragon could beat three owlbears if the owlbears had armor and magic wands and the dragon had a sword.",
  "A local noble is in town collecting his taxes that are due.",
  "The worst bandit in the world attempts to rob you with a sharpened stick and a dented pot lid. He faints.",
  "You find a sign pinned to your back reading 'Ass'. It is unknown when it was placed there or how long it's been there.",
  "A maze is nearby, it's still in the process of being excavated and won't be ready for several more years.",
  "You find a sock puppet nestled amongst your belongings. It appears to be made from a freshly worn (and still smelly) sock.",
  "You find a flask of good booze you had forgot about amongst your belongings.",
  "You find a bag of honeyed nuts amongst your belongings."
]
